<a href="https://colab.research.google.com/github/Berenice2018/DeepLearning/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Notes about Pandas**

In [0]:
import numpy as np
import pandas as pd

# Creating pandas Series

A Pandas series is a one-dimensional array-like object that can hold many data types

| Pandas Series | NumPy ndarray |
| --- | --- | 
| you can assign an index label to each element | cannot | 
| can hold data of different data types | cannot |
| data is not indexed with the label names |  indexed with numbers

In [120]:
# create a Pandas Series that stores a grocery list
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

# We display the Groceries Pandas Series
print(groceries)

print('\nGroceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [121]:
# print the index and data of the series
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [122]:
# Check if a label exists in the series
x = 'apples' in groceries
y = 'elephant' in groceries
print(x, y)

True False

# Accessing and Deleting Elements in pandas Series

The attribute *.loc* stands for location, it states that we are using a **labeled** index. 

The attribute .*iloc* stands for integer location, it states that we are using a **numerical** index.

In [123]:
# single index label
print('How many eggs do we need to buy:', groceries['eggs'])
# access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
# use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

# use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
# use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
# use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
# access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object
How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object
Do we need bread:
 bread    No
dtype: object
How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

`Series.drop(label)`  

drops elements from the Series out of place, it doesn't change the original Series being modified

Delete items from a Pandas Series in place by setting the keyword  `inplace` to `True` in the `.drop()`

In [124]:
print('Original Grocery List:\n', groceries)

# remove apples from our grocery list. The drop function removes elements out of place
print('\nWe remove apples (out of place):\n', groceries.drop('apples'))

print('\nOriginal grocery List after removing apples out of place:\n', groceries)

groceries.drop(['apples', 'eggs'], inplace = True)
print('\nRemoved apples and eggs in place:\n', groceries )

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

We remove apples (out of place):
 eggs      30
milk     Yes
bread     No
dtype: object

Original grocery List after removing apples out of place:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Removed apples and eggs in place:
 milk     Yes
bread     No
dtype: object

# Arithmetic operations

In [125]:
# a Pandas Series that stores a grocery list of just fruits
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [126]:
# apply arithmetic operations to each item in fruits
print('fruits + 2:\n', fruits + 2)
print('\nfruits - 2:\n', fruits - 2)
print('\nfruits * 2:\n', fruits * 2) 
print('\nfruits / 2:\n', fruits / 2) # results in dtype float64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [127]:
# apply different mathematical functions to all elements of fruits
print('\nEXP(X) = \n', np.exp(fruits))
print('\nSQRT(X) =\n', np.sqrt(fruits))
print('\nPOW(X,2) =\n',np.power(fruits,2)) # raise to the power of 2

EXP(X) =
 apples     22026.5
oranges      403.4
bananas       20.1
dtype: float64

SQRT(X) =
 apples     3.2
oranges    2.4
bananas    1.7
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

Apply arithmetic operations on Pandas Series of mixed data type provided that the **arithmetic operation is defined for all data types** in the Series

When you have mixed data types in your Pandas Series make sure the arithmetic operations are valid on all the data types of your elements.

In [128]:
series2 = pd.Series([100], index=['cherries'])

print(groceries.append(series2) *2)
print()
groceries * 2

milk        YesYes
bread         NoNo
cherries       200
dtype: object

milk     YesYes
bread      NoNo
dtype: object

In [129]:
# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter'] 

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data = distance_from_sun, index = planets)
print(dist_planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18
print('\ntime_light:\n', time_light)

# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40] 
print('\nclose_planets:\n', close_planets)

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

time_light:
 Earth       8.3
Saturn     79.6
Mars       12.7
Venus       6.0
Jupiter    43.3
dtype: float64

close_planets:
 Earth     8.3
Mars     12.7
Venus     6.0
dtype: float64

# Creating Pandas DataFrames

Pandas DataFrames are 2-dimensional data structures with labeled rows and columns, that can hold many data types. (Like an Excel spreadsheet)

Create Pandas DataFrames manually or by loading data from a file.

In [130]:

# create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# print the type of items to see that it is a dictionary
print(type(items))


# create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)

shopping_carts

<class 'dict'>

         Alice    Bob
bike     500.0  245.0
book      40.0    NaN
glasses  110.0    NaN
pants     45.0   25.0
watch      NaN   55.0

So whenever a DataFrame is created, if a particular column doesn't have values for a particular row index, Pandas will put a NaN value there. 

If we were to feed this data into a machine learning algorithm we will have to remove these NaN values first.

If we don't provide index labels to the Pandas Series, Pandas will use numerical row indexes when it creates the DataFrame:
Example:

In [131]:
# Create a dictionary of Pandas Series without indices
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

# create a DataFrame
df = pd.DataFrame(data)
df

   Alice    Bob
0     40  245.0
1    110   25.0
2    500   55.0
3     45    NaN

In [132]:
# print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The values in shopping_carts is:\n', shopping_carts.values)
print()
print('The row indices in shopping_carts are:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The values in shopping_carts is:
 [[500. 245.]
 [ 40.  nan]
 [110.  nan]
 [ 45.  25.]
 [ nan  55.]]

The row indices in shopping_carts are: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Alice', 'Bob'], dtype='object')

Select which data we want to put into our DataFrame by means of the keywords columns and index

In [133]:
# Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
print(bob_shopping_cart)


# Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
print('\n', sel_shopping_cart)

# Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

       Bob
bike   245
pants   25
watch   55

        Alice   Bob
pants     45  25.0
book      40   NaN

         Alice
glasses    110
bike       500

Create DataFrames **from a dictionary of lists** (arrays). 
All the lists (arrays) in the dictionary must be of the same length.

In [134]:
# create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Floats  Integers
label 1     4.5         1
label 2     8.2         2
label 3     9.6         3

**using a list of Python dictionaries**

In [135]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# create a DataFrame 
# store_items = pd.DataFrame(items2)
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

# Accessing elements in DataFrames

Access rows, columns, or individual elements of the DataFrame by using the row and column labels

In [136]:
print(store_items)

# access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store?\n', store_items[['pants', 'bikes']])
print()
print('What items are in Store 1?\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2?', store_items['bikes']['store 2']) # dataframe[column][row]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store?
          pants  bikes
store 1     30     20
store 2      5     15

What items are in Store 1?
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

How many bikes are in Store 2? 15

Add new columns to  DataFrames

In [137]:
# add a new column named shirts to store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

Add new columns to our DataFrame by using arithmetic operations between other columns

In [138]:
# make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

Suppose now, that you opened a new store and you need to add the number of items in stock of that new store into your DataFrame. 

We can do this by adding a new row to the `store_items` Dataframe. 

To add rows to our DataFrame we first have to create a new Dataframe and then append it to the original DataFrame. 

By appending a new row to the DataFrame, the columns will be put in alphabetical order.

In [139]:
# create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# create a new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])
#new_store

# append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

Add new columns of our DataFrame by using only data from particular rows in particular columns. 

For example, suppose that you want to stock stores 2 and 3 with new watches and you want the quantity of the new watches to be the same as the watches already in stock for those stores

In [140]:
# add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

 `dataframe.insert(loc,label,data) `method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data

In [141]:
# insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

To delete rows and columns from our DataFrame we will use the `.pop() `and` .drop()` methods. 

`.pop()`:  delete columns

`.drop()` delete both rows and columns by use of the axis keyword.

In [142]:
# remove the new watches column
store_items.pop('new watches')
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [143]:
# remove columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
#store_items

# remove rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

`.rename()`

change the row and column labels

In [144]:
# change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

`.set_index()`

In [145]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

# Dealing with NaN

In [146]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [147]:
# We count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

`.sum() `

In order to count the total number of logical True values we use the `.sum() ` method twice. 

We have to use it twice because the first sum returns a Pandas Series with the sums of logical True values along columns


`.count()`

Count the number of non-NaN values by using

In [148]:
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

`.dropna(axis)` 

eliminates any rows / columns with NaN values

In [149]:
# drop any rows with NaN values
store_items.dropna(axis = 0)
store_items.dropna(axis = 1) # drop columns

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

`.fillna() `

replaces (fills) the NaN values out of place. 

Replace the NaN values in place by setting the keyword` inplace = True` inside the `fillna()` function.

In [150]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

**Forward filling:**
 
 We can also use the` .fillna()` method 
 
 to replace `NaN` values with previous values in the DataFrame.

When replacing NaN values with forward filling, we can use previous values taken from columns or rows. 

The` .fillna(method = 'ffill', axis)` will use the forward filling (`ffill`) method to replace NaN values using the previous known value along the given axis.

In [151]:
# replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)
# store1 NaN will not get replaced. That's because there are no previous values in this column. 
# forward fill using the previous row values, this won't happen

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [152]:
# replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

**Backward filling. **

The `.fillna(method = 'backfill', axis)` 

will use the backward filling (backfill) method to replace NaN values using the next known value along the given axis. Just like with forward filling we can choose to use row or column values

In [153]:
# replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

Two NaN values in store 3 didn't get replaced, because there are no next values in these columns, 

If we do backward fill using the next row values, this won't happen

In [154]:
# replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

Replace `NaN` values by using different **interpolation methods. **

For example, the

` .interpolate(method = 'linear', axis)` 

method will use linear interpolation to replace NaN values using the values along the given axis.

In [155]:
# replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [156]:
# replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

# Exercise

In [157]:
# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Author': authors,
      'Title': books,
      'User1': user_1,
      'User2': user_2,
      'User3': user_3}

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.
print(book_ratings)

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this.

#book_ratings.fillna(method='ffill', axis=0)
#book_ratings.fillna(book_ratings.mean(), inplace=True)
book_ratings.fillna(book_ratings.mean(), inplace=False)

                Author                Title  User1  User2  User3
0      Charles Dickens   Great Expectations    3.2    5.0    2.0
1       John Steinbeck      Of Mice and Men    NaN    1.3    2.3
2  William Shakespeare     Romeo and Juliet    2.5    4.0    NaN
3          H. G. Wells     The Time Machine    NaN    3.8    4.0
4        Lewis Carroll  Alice in Wonderland    NaN    NaN    NaN

                Author                Title  User1  User2  User3
0      Charles Dickens   Great Expectations    3.2    5.0    2.0
1       John Steinbeck      Of Mice and Men    2.9    1.3    2.3
2  William Shakespeare     Romeo and Juliet    2.5    4.0    2.8
3          H. G. Wells     The Time Machine    2.9    3.8    4.0
4        Lewis Carroll  Alice in Wonderland    2.9    3.5    2.8

# Loading Data into a pandas DataFrame

 load CSV files into Pandas DataFrames using the `pd.read_csv()` function.

In [158]:
# We load Google stock data in a DataFrame
test_stock = pd.read_csv('sample_data/california_housing_test.csv')

# We print some information about Google_stock
print('test_stock is of type:', type(test_stock))
print('test_stock has shape:', test_stock.shape)

test_stock is of type: <class 'pandas.core.frame.DataFrame'>
test_stock has shape: (3000, 9)

  `.head() ` or  `.head(N)`
  
  take a look at the first 5 or N  rows of data
  
  `.tail()` or `.tail(N)`

 take a look at the last 5 or N rows of data

In [159]:
#  take a look at the first 5 rows of data using the .head() method
test_stock.head()
test_stock.tail(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
2997,-119.7,36.3,10.0,956.0,201.0,693.0,220.0,2.3,62000.0
2998,-117.1,34.1,40.0,96.0,14.0,46.0,14.0,3.3,162500.0
2999,-119.6,34.4,42.0,1765.0,263.0,753.0,260.0,8.6,500001.0

` .isnull().any()` 

check whether any of the columns contain NaN values.

In [160]:
test_stock.isnull().any()
# we will have no NaN values.

longitude             False
latitude              False
housing_median_age    False
total_rooms           False
total_bedrooms        False
population            False
households            False
median_income         False
median_house_value    False
dtype: bool

` .describe() `
 
 get descriptive statistics on each column of the DataFrame
 
 or on a single column

In [161]:
test_stock.describe()
#test_stock['total_rooms'].describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0
mean,-119.6,35.6,28.8,2599.6,530.0,1402.8,489.9,3.8,205846.3
std,2.0,2.1,12.6,2155.6,415.7,1030.5,365.4,1.9,113119.7
min,-124.2,32.6,1.0,6.0,2.0,5.0,2.0,0.5,22500.0
25%,-121.8,33.9,18.0,1401.0,291.0,780.0,273.0,2.5,121200.0
50%,-118.5,34.3,29.0,2106.0,437.0,1155.0,409.5,3.5,177650.0
75%,-118.0,37.7,37.0,3129.0,636.0,1742.8,597.2,4.7,263975.0
max,-114.5,41.9,52.0,30450.0,5419.0,11935.0,4930.0,15.0,500001.0

In [162]:
# print information about our DataFrame  
print()
print('Maximum values of each column:\n', test_stock.max())
print()
print('Minimum Close value:', test_stock['total_rooms'].min())
print()
print('Average value of each column:\n', test_stock.mean())

Maximum values of each column:
 longitude               -114.5
latitude                  41.9
housing_median_age        52.0
total_rooms            30450.0
total_bedrooms          5419.0
population             11935.0
households              4930.0
median_income             15.0
median_house_value    500001.0
dtype: float64

Minimum Close value: 6.0

Average value of each column:
 longitude               -119.6
latitude                  35.6
housing_median_age        28.8
total_rooms             2599.6
total_bedrooms           530.0
population              1402.8
households               489.9
median_income              3.8
median_house_value    205846.3
dtype: float64

` .corr() `
 
 to get the correlation between different columns
 
 A correlation value of 1 tells us there is a high correlation and a correlation of 0 tells us that the data is not correlated at all.

In [163]:
test_stock.corr()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
longitude,1.0e+00,-9.3e-01,-6.4e-02,5.0e-02,7.1e-02,1.1e-01,5.1e-02,-1.9e-02,-5.1e-02
latitude,-9.3e-01,1.0e+00,-2.5e-02,-4.0e-02,-6.8e-02,-1.2e-01,-6.8e-02,-7.2e-02,-1.4e-01
housing_median_age,-6.4e-02,-2.5e-02,1.0e+00,-3.7e-01,-3.2e-01,-3.0e-01,-3.1e-01,-1.4e-01,9.1e-02
total_rooms,5.0e-02,-4.0e-02,-3.7e-01,1.0e+00,9.4e-01,8.4e-01,9.1e-01,2.2e-01,1.6e-01
total_bedrooms,7.1e-02,-6.8e-02,-3.2e-01,9.4e-01,1.0e+00,8.6e-01,9.7e-01,2.4e-02,8.2e-02
population,1.1e-01,-1.2e-01,-3.0e-01,8.4e-01,8.6e-01,1.0e+00,9.0e-01,3.2e-02,-1.2e-03
households,5.1e-02,-6.8e-02,-3.1e-01,9.1e-01,9.7e-01,9.0e-01,1.0e+00,4.9e-02,1.0e-01
median_income,-1.9e-02,-7.2e-02,-1.4e-01,2.2e-01,2.4e-02,3.2e-02,4.9e-02,1.0e+00,6.7e-01
median_house_value,-5.1e-02,-1.4e-01,9.1e-02,1.6e-01,8.2e-02,-1.2e-03,1.0e-01,6.7e-01,1.0e+00

` .groupby() `
 
 allows us to group data in different ways.
 
 group data to get different types of information

In [164]:
# We load fake data in a DataFrame
fake_data = pd.read_csv('sample_data/california_housing_train.csv')
fake_data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.3,34.2,15.0,5612.0,1283.0,1015.0,472.0,1.5,66900.0
1,-114.5,34.4,19.0,7650.0,1901.0,1129.0,463.0,1.8,80100.0
2,-114.6,33.7,17.0,720.0,174.0,333.0,117.0,1.7,85700.0
3,-114.6,33.6,14.0,1501.0,337.0,515.0,226.0,3.2,73400.0
4,-114.6,33.6,20.0,1454.0,326.0,624.0,262.0,1.9,65500.0

In [165]:
fake_data.groupby(['longitude','latitude'])['households'].sum().head(16)

longitude  latitude
-124.3     40.5        270.0
           41.8        478.0
           41.8        456.0
           40.7        465.0
           40.6        369.0
-124.2     40.3        187.0
           40.5        435.0
           40.8        172.0
           41.8        479.0
           41.7        653.0
           40.8        268.0
           41.8        721.0
           41.8        647.0
           40.7        972.0
           40.8        583.0
           40.8        260.0
Name: households, dtype: float64